grevaillot/svd_tools/headers/STM32F7x5/otg_hs_host.h
#define OTG_HS_HOST_OTG_HS_HPTXSTS_PTXQTOP_SHIFT		24
#define OTG_HS_HOST_OTG_HS_HPTXSTS_PTXQTOP_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hptxsts_ptxqtop PTXQTOP Top of the periodic transmit request queue
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HPTXSTS_PTXQSAV_SHIFT		16
#define OTG_HS_HOST_OTG_HS_HPTXSTS_PTXQSAV_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hptxsts_ptxqsav PTXQSAV Periodic transmit request queue space available
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HPTXSTS_PTXFSAVL_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HPTXSTS_PTXFSAVL_MASK		0xffff
/** @defgroup otg_hs_host_otg_hs_hptxsts_ptxfsavl PTXFSAVL Periodic transmit data FIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_haint OTGHSHAINT OTG_HS Host all channels interrupt register
@{*/


#define OTG_HS_HOST_OTG_HS_HAINT_HAINT_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HAINT_HAINT_MASK		0xffff
/** @defgroup otg_hs_host_otg_hs_haint_haint HAINT Channel interrupts
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_haintmsk OTGHSHAINTMSK OTG_HS host all channels interrupt mask register
@{*/


#define OTG_HS_HOST_OTG_HS_HAINTMSK_HAINTM_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HAINTMSK_HAINTM_MASK		0xffff
/** @defgroup otg_hs_host_otg_hs_haintmsk_haintm HAINTM Channel interrupt mask
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hprt OTGHSHPRT OTG_HS host port control and status register
@{*/


#define OTG_HS_HOST_OTG_HS_HPRT_PSPD_SHIFT		17
#define OTG_HS_HOST_OTG_HS_HPRT_PSPD_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hprt_pspd PSPD Port speed
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HPRT_PTCTL_SHIFT		13
#define OTG_HS_HOST_OTG_HS_HPRT_PTCTL_MASK		0x0f
/** @defgroup otg_hs_host_otg_hs_hprt_ptctl PTCTL Port test control
@{*/
/**@}*/

/** OTG_HS_HOST_OTG_HS_HPRT_PPWR Port power **/
#define OTG_HS_HOST_OTG_HS_HPRT_PPWR		(1 << 12)

#define OTG_HS_HOST_OTG_HS_HPRT_PLSTS_SHIFT		10
#define OTG_HS_HOST_OTG_HS_HPRT_PLSTS_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hprt_plsts PLSTS Port line status
@{*/
/**@}*/

/** OTG_HS_HOST_OTG_HS_HPRT_PRST Port reset **/
#define OTG_HS_HOST_OTG_HS_HPRT_PRST		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HPRT_PSUSP Port suspend **/
#define OTG_HS_HOST_OTG_HS_HPRT_PSUSP		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HPRT_PRES Port resume **/
#define OTG_HS_HOST_OTG_HS_HPRT_PRES		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HPRT_POCCHNG Port overcurrent change **/
#define OTG_HS_HOST_OTG_HS_HPRT_POCCHNG		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HPRT_POCA Port overcurrent active **/
#define OTG_HS_HOST_OTG_HS_HPRT_POCA		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HPRT_PENCHNG Port enable/disable change **/
#define OTG_HS_HOST_OTG_HS_HPRT_PENCHNG		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HPRT_PENA Port enable **/
#define OTG_HS_HOST_OTG_HS_HPRT_PENA		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HPRT_PCDET Port connect detected **/
#define OTG_HS_HOST_OTG_HS_HPRT_PCDET		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HPRT_PCSTS Port connect status **/
#define OTG_HS_HOST_OTG_HS_HPRT_PCSTS		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcchar0 OTGHSHCCHAR0 OTG_HS host channel-0 characteristics register
@{*/

/** OTG_HS_HOST_OTG_HS_HCCHAR0_CHENA Channel enable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR0_CHENA		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCCHAR0_CHDIS Channel disable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR0_CHDIS		(1 << 30)
/** OTG_HS_HOST_OTG_HS_HCCHAR0_ODDFRM Odd frame **/
#define OTG_HS_HOST_OTG_HS_HCCHAR0_ODDFRM		(1 << 29)

#define OTG_HS_HOST_OTG_HS_HCCHAR0_DAD_SHIFT		22
#define OTG_HS_HOST_OTG_HS_HCCHAR0_DAD_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcchar0_dad DAD Device address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR0_MC_SHIFT		20
#define OTG_HS_HOST_OTG_HS_HCCHAR0_MC_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar0_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR0_EPTYP_SHIFT		18
#define OTG_HS_HOST_OTG_HS_HCCHAR0_EPTYP_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar0_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_HOST_OTG_HS_HCCHAR0_LSDEV Low-speed device **/
#define OTG_HS_HOST_OTG_HS_HCCHAR0_LSDEV		(1 << 17)
/** OTG_HS_HOST_OTG_HS_HCCHAR0_EPDIR Endpoint direction **/
#define OTG_HS_HOST_OTG_HS_HCCHAR0_EPDIR		(1 << 15)

#define OTG_HS_HOST_OTG_HS_HCCHAR0_EPNUM_SHIFT		11
#define OTG_HS_HOST_OTG_HS_HCCHAR0_EPNUM_MASK		0x0f
/** @defgroup otg_hs_host_otg_hs_hcchar0_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR0_MPSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCCHAR0_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_host_otg_hs_hcchar0_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcsplt0 OTGHSHCSPLT0 OTG_HS host channel-0 split control register
@{*/

/** OTG_HS_HOST_OTG_HS_HCSPLT0_SPLITEN Split enable **/
#define OTG_HS_HOST_OTG_HS_HCSPLT0_SPLITEN		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCSPLT0_COMPLSPLT Do complete split **/
#define OTG_HS_HOST_OTG_HS_HCSPLT0_COMPLSPLT		(1 << 16)

#define OTG_HS_HOST_OTG_HS_HCSPLT0_XACTPOS_SHIFT		14
#define OTG_HS_HOST_OTG_HS_HCSPLT0_XACTPOS_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcsplt0_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT0_HUBADDR_SHIFT		7
#define OTG_HS_HOST_OTG_HS_HCSPLT0_HUBADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt0_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT0_PRTADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCSPLT0_PRTADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt0_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcint0 OTGHSHCINT0 OTG_HS host channel-11 interrupt register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINT0_DTERR Data toggle error **/
#define OTG_HS_HOST_OTG_HS_HCINT0_DTERR		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINT0_FRMOR Frame overrun **/
#define OTG_HS_HOST_OTG_HS_HCINT0_FRMOR		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINT0_BBERR Babble error **/
#define OTG_HS_HOST_OTG_HS_HCINT0_BBERR		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINT0_TXERR Transaction error **/
#define OTG_HS_HOST_OTG_HS_HCINT0_TXERR		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINT0_NYET Response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT0_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINT0_ACK ACK response received/transmitted interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT0_ACK		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINT0_NAK NAK response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT0_NAK		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINT0_STALL STALL response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT0_STALL		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINT0_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINT0_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINT0_CHH Channel halted **/
#define OTG_HS_HOST_OTG_HS_HCINT0_CHH		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINT0_XFRC Transfer completed **/
#define OTG_HS_HOST_OTG_HS_HCINT0_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcintmsk0 OTGHSHCINTMSK0 OTG_HS host channel-11 interrupt mask register
@{*/

