grevaillot/svd_tools/headers/STM32F7x5/otg_hs_host.h
#define OTG_HS_HOST_OTG_HS_HCCHAR6_DAD_SHIFT		22
#define OTG_HS_HOST_OTG_HS_HCCHAR6_DAD_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcchar6_dad DAD Device address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR6_MC_SHIFT		20
#define OTG_HS_HOST_OTG_HS_HCCHAR6_MC_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar6_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR6_EPTYP_SHIFT		18
#define OTG_HS_HOST_OTG_HS_HCCHAR6_EPTYP_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar6_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_HOST_OTG_HS_HCCHAR6_LSDEV Low-speed device **/
#define OTG_HS_HOST_OTG_HS_HCCHAR6_LSDEV		(1 << 17)
/** OTG_HS_HOST_OTG_HS_HCCHAR6_EPDIR Endpoint direction **/
#define OTG_HS_HOST_OTG_HS_HCCHAR6_EPDIR		(1 << 15)

#define OTG_HS_HOST_OTG_HS_HCCHAR6_EPNUM_SHIFT		11
#define OTG_HS_HOST_OTG_HS_HCCHAR6_EPNUM_MASK		0x0f
/** @defgroup otg_hs_host_otg_hs_hcchar6_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR6_MPSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCCHAR6_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_host_otg_hs_hcchar6_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcsplt6 OTGHSHCSPLT6 OTG_HS host channel-6 split control register
@{*/

/** OTG_HS_HOST_OTG_HS_HCSPLT6_SPLITEN Split enable **/
#define OTG_HS_HOST_OTG_HS_HCSPLT6_SPLITEN		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCSPLT6_COMPLSPLT Do complete split **/
#define OTG_HS_HOST_OTG_HS_HCSPLT6_COMPLSPLT		(1 << 16)

#define OTG_HS_HOST_OTG_HS_HCSPLT6_XACTPOS_SHIFT		14
#define OTG_HS_HOST_OTG_HS_HCSPLT6_XACTPOS_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcsplt6_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT6_HUBADDR_SHIFT		7
#define OTG_HS_HOST_OTG_HS_HCSPLT6_HUBADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt6_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT6_PRTADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCSPLT6_PRTADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt6_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcint6 OTGHSHCINT6 OTG_HS host channel-6 interrupt register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINT6_DTERR Data toggle error **/
#define OTG_HS_HOST_OTG_HS_HCINT6_DTERR		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINT6_FRMOR Frame overrun **/
#define OTG_HS_HOST_OTG_HS_HCINT6_FRMOR		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINT6_BBERR Babble error **/
#define OTG_HS_HOST_OTG_HS_HCINT6_BBERR		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINT6_TXERR Transaction error **/
#define OTG_HS_HOST_OTG_HS_HCINT6_TXERR		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINT6_NYET Response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT6_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINT6_ACK ACK response received/transmitted interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT6_ACK		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINT6_NAK NAK response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT6_NAK		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINT6_STALL STALL response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT6_STALL		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINT6_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINT6_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINT6_CHH Channel halted **/
#define OTG_HS_HOST_OTG_HS_HCINT6_CHH		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINT6_XFRC Transfer completed **/
#define OTG_HS_HOST_OTG_HS_HCINT6_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcintmsk6 OTGHSHCINTMSK6 OTG_HS host channel-6 interrupt mask register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINTMSK6_DTERRM Data toggle error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_DTERRM		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINTMSK6_FRMORM Frame overrun mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_FRMORM		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINTMSK6_BBERRM Babble error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_BBERRM		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINTMSK6_TXERRM Transaction error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_TXERRM		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINTMSK6_NYET response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINTMSK6_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_ACKM		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINTMSK6_NAKM NAK response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_NAKM		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINTMSK6_STALLM STALL response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_STALLM		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINTMSK6_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINTMSK6_CHHM Channel halted mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_CHHM		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINTMSK6_XFRCM Transfer completed mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsiz6 OTGHSHCTSIZ6 OTG_HS host channel-6 transfer size register
@{*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ6_DPID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZ6_DPID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsiz6_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ6_PKTCNT_SHIFT		19
#define OTG_HS_HOST_OTG_HS_HCTSIZ6_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_host_otg_hs_hctsiz6_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ6_XFRSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZ6_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_host_otg_hs_hctsiz6_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdma6 OTGHSHCDMA6 OTG_HS host channel-6 DMA address register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMA6_DMAADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCDMA6_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_host_otg_hs_hcdma6_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcchar7 OTGHSHCCHAR7 OTG_HS host channel-7 characteristics register
@{*/

/** OTG_HS_HOST_OTG_HS_HCCHAR7_CHENA Channel enable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR7_CHENA		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCCHAR7_CHDIS Channel disable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR7_CHDIS		(1 << 30)
/** OTG_HS_HOST_OTG_HS_HCCHAR7_ODDFRM Odd frame **/
#define OTG_HS_HOST_OTG_HS_HCCHAR7_ODDFRM		(1 << 29)

