grevaillot/svd_tools/headers/STM32F7x5/otg_hs_host.h
#define OTG_HS_HOST_OTG_HS_HCTSIZ11_XFRSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZ11_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_host_otg_hs_hctsiz11_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdma11 OTGHSHCDMA11 OTG_HS host channel-11 DMA address register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMA11_DMAADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCDMA11_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_host_otg_hs_hcdma11_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcchar12 OTGHSHCCHAR12 OTG_HS host channel-12 characteristics register
@{*/

/** OTG_HS_HOST_OTG_HS_HCCHAR12_CHENA Channel enable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR12_CHENA		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCCHAR12_CHDIS Channel disable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR12_CHDIS		(1 << 30)
/** OTG_HS_HOST_OTG_HS_HCCHAR12_ODDFRM Odd frame **/
#define OTG_HS_HOST_OTG_HS_HCCHAR12_ODDFRM		(1 << 29)

#define OTG_HS_HOST_OTG_HS_HCCHAR12_DAD_SHIFT		22
#define OTG_HS_HOST_OTG_HS_HCCHAR12_DAD_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcchar12_dad DAD Device address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR12_MC_SHIFT		20
#define OTG_HS_HOST_OTG_HS_HCCHAR12_MC_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar12_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR12_EPTYP_SHIFT		18
#define OTG_HS_HOST_OTG_HS_HCCHAR12_EPTYP_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar12_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_HOST_OTG_HS_HCCHAR12_LSDEV Low-speed device **/
#define OTG_HS_HOST_OTG_HS_HCCHAR12_LSDEV		(1 << 17)
/** OTG_HS_HOST_OTG_HS_HCCHAR12_EPDIR Endpoint direction **/
#define OTG_HS_HOST_OTG_HS_HCCHAR12_EPDIR		(1 << 15)

#define OTG_HS_HOST_OTG_HS_HCCHAR12_EPNUM_SHIFT		11
#define OTG_HS_HOST_OTG_HS_HCCHAR12_EPNUM_MASK		0x0f
/** @defgroup otg_hs_host_otg_hs_hcchar12_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR12_MPSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCCHAR12_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_host_otg_hs_hcchar12_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcsplt12 OTGHSHCSPLT12 OTG_HS host channel-12 split control register
@{*/

/** OTG_HS_HOST_OTG_HS_HCSPLT12_SPLITEN Split enable **/
#define OTG_HS_HOST_OTG_HS_HCSPLT12_SPLITEN		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCSPLT12_COMPLSPLT Do complete split **/
#define OTG_HS_HOST_OTG_HS_HCSPLT12_COMPLSPLT		(1 << 16)

#define OTG_HS_HOST_OTG_HS_HCSPLT12_XACTPOS_SHIFT		14
#define OTG_HS_HOST_OTG_HS_HCSPLT12_XACTPOS_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcsplt12_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT12_HUBADDR_SHIFT		7
#define OTG_HS_HOST_OTG_HS_HCSPLT12_HUBADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt12_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT12_PRTADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCSPLT12_PRTADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt12_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcint12 OTGHSHCINT12 OTG_HS host channel-12 interrupt register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINT12_DTERR Data toggle error **/
#define OTG_HS_HOST_OTG_HS_HCINT12_DTERR		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINT12_FRMOR Frame overrun **/
#define OTG_HS_HOST_OTG_HS_HCINT12_FRMOR		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINT12_BBERR Babble error **/
#define OTG_HS_HOST_OTG_HS_HCINT12_BBERR		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINT12_TXERR Transaction error **/
#define OTG_HS_HOST_OTG_HS_HCINT12_TXERR		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINT12_NYET Response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT12_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINT12_ACK ACK response received/transmitted interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT12_ACK		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINT12_NAK NAK response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT12_NAK		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINT12_STALL STALL response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT12_STALL		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINT12_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINT12_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINT12_CHH Channel halted **/
#define OTG_HS_HOST_OTG_HS_HCINT12_CHH		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINT12_XFRC Transfer completed **/
#define OTG_HS_HOST_OTG_HS_HCINT12_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcintmsk12 OTGHSHCINTMSK12 OTG_HS host channel-12 interrupt mask register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINTMSK12_DTERRM Data toggle error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK12_DTERRM		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINTMSK12_FRMORM Frame overrun mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK12_FRMORM		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINTMSK12_BBERRM Babble error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK12_BBERRM		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINTMSK12_TXERRM Transaction error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK12_TXERRM		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINTMSK12_NYET Response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK12_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINTMSK12_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK12_ACKM		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINTMSK12_NAKM NAK response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK12_NAKM		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINTMSK12_STALLM STALL response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK12_STALLM		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINTMSK12_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK12_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINTMSK12_CHHM Channel halted mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK12_CHHM		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINTMSK12_XFRCM Transfer completed mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK12_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsiz12 OTGHSHCTSIZ12 OTG_HS host channel-12 transfer size register
@{*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ12_DPID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZ12_DPID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsiz12_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ12_PKTCNT_SHIFT		19
#define OTG_HS_HOST_OTG_HS_HCTSIZ12_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_host_otg_hs_hctsiz12_pktcnt PKTCNT Packet count
@{*/
/**@}*/


