grevaillot/svd_tools/headers/STM32F7x5/otg_hs_host.h
#define OTG_HS_HOST_OTG_HS_HCTSIZ14_XFRSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZ14_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_host_otg_hs_hctsiz14_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdma14 OTGHSHCDMA14 OTG_HS host channel-14 DMA address register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMA14_DMAADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCDMA14_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_host_otg_hs_hcdma14_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcchar15 OTGHSHCCHAR15 OTG_HS host channel-15 characteristics register
@{*/

/** OTG_HS_HOST_OTG_HS_HCCHAR15_CHENA Channel enable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR15_CHENA		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCCHAR15_CHDIS Channel disable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR15_CHDIS		(1 << 30)
/** OTG_HS_HOST_OTG_HS_HCCHAR15_ODDFRM Odd frame **/
#define OTG_HS_HOST_OTG_HS_HCCHAR15_ODDFRM		(1 << 29)

#define OTG_HS_HOST_OTG_HS_HCCHAR15_DAD_SHIFT		22
#define OTG_HS_HOST_OTG_HS_HCCHAR15_DAD_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcchar15_dad DAD Device address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR15_MC_SHIFT		20
#define OTG_HS_HOST_OTG_HS_HCCHAR15_MC_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar15_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR15_EPTYP_SHIFT		18
#define OTG_HS_HOST_OTG_HS_HCCHAR15_EPTYP_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar15_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_HOST_OTG_HS_HCCHAR15_LSDEV Low-speed device **/
#define OTG_HS_HOST_OTG_HS_HCCHAR15_LSDEV		(1 << 17)
/** OTG_HS_HOST_OTG_HS_HCCHAR15_EPDIR Endpoint direction **/
#define OTG_HS_HOST_OTG_HS_HCCHAR15_EPDIR		(1 << 15)

#define OTG_HS_HOST_OTG_HS_HCCHAR15_EPNUM_SHIFT		11
#define OTG_HS_HOST_OTG_HS_HCCHAR15_EPNUM_MASK		0x0f
/** @defgroup otg_hs_host_otg_hs_hcchar15_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR15_MPSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCCHAR15_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_host_otg_hs_hcchar15_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcsplt15 OTGHSHCSPLT15 OTG_HS host channel-15 split control register
@{*/

/** OTG_HS_HOST_OTG_HS_HCSPLT15_SPLITEN Split enable **/
#define OTG_HS_HOST_OTG_HS_HCSPLT15_SPLITEN		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCSPLT15_COMPLSPLT Do complete split **/
#define OTG_HS_HOST_OTG_HS_HCSPLT15_COMPLSPLT		(1 << 16)

#define OTG_HS_HOST_OTG_HS_HCSPLT15_XACTPOS_SHIFT		14
#define OTG_HS_HOST_OTG_HS_HCSPLT15_XACTPOS_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcsplt15_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT15_HUBADDR_SHIFT		7
#define OTG_HS_HOST_OTG_HS_HCSPLT15_HUBADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt15_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT15_PRTADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCSPLT15_PRTADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt15_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcint15 OTGHSHCINT15 OTG_HS host channel-15 interrupt register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINT15_DTERR Data toggle error **/
#define OTG_HS_HOST_OTG_HS_HCINT15_DTERR		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINT15_FRMOR Frame overrun **/
#define OTG_HS_HOST_OTG_HS_HCINT15_FRMOR		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINT15_BBERR Babble error **/
#define OTG_HS_HOST_OTG_HS_HCINT15_BBERR		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINT15_TXERR Transaction error **/
#define OTG_HS_HOST_OTG_HS_HCINT15_TXERR		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINT15_NYET Response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT15_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINT15_ACK ACK response received/transmitted interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT15_ACK		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINT15_NAK NAK response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT15_NAK		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINT15_STALL STALL response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT15_STALL		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINT15_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINT15_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINT15_CHH Channel halted **/
#define OTG_HS_HOST_OTG_HS_HCINT15_CHH		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINT15_XFRC Transfer completed **/
#define OTG_HS_HOST_OTG_HS_HCINT15_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcintmsk15 OTGHSHCINTMSK15 OTG_HS host channel-15 interrupt mask register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINTMSK15_DTERRM Data toggle error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK15_DTERRM		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINTMSK15_FRMORM Frame overrun mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK15_FRMORM		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINTMSK15_BBERRM Babble error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK15_BBERRM		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINTMSK15_TXERRM Transaction error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK15_TXERRM		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINTMSK15_NYET Response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK15_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINTMSK15_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK15_ACKM		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINTMSK15_NAKM NAK response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK15_NAKM		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINTMSK15_STALL STALL response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK15_STALL		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINTMSK15_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK15_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINTMSK15_CHHM Channel halted mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK15_CHHM		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINTMSK15_XFRCM Transfer completed mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK15_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsiz15 OTGHSHCTSIZ15 OTG_HS host channel-15 transfer size register
@{*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ15_DPID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZ15_DPID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsiz15_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT_SHIFT		19
#define OTG_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_host_otg_hs_hctsiz15_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_host_otg_hs_hctsiz15_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdma15 OTGHSHCDMA15 OTG_HS host channel-15 DMA address register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMA15_DMAADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCDMA15_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_host_otg_hs_hcdma15_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/
